---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeTypeFamilySaved
source: html/d924d14d-0dfd-5b83-cc3f-eeb44bf233ff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeTypeFamilySaved Property

Can't make type "[Family Name]". Failing family has been saved to "[File Name]"

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeTypeFamilySaved { get; }
```